UAS/warungemak/app/Models/Pages/MenuModel.php

SELECT `daftar_menu`.*, `kategori_menu`.`deskripsi_kategori`, `kategori_menu`.`nama_kategori` AS `nama_kategori`
FROM `daftar_menu`
JOIN `kategori_menu` ON `kategori_menu`.`id_kategori` = `daftar_menu`.`id_kategori`
ORDER BY `kategori_menu`.`nama_kategori` ASC
---
    public function getMenuDenganKategori()

    {
        return $this->select('daftar_menu.*, kategori_menu.deskripsi_kategori, kategori_menu.nama_kategori AS nama_kategori')
                    ->join('kategori_menu', 'kategori_menu.id_kategori = daftar_menu.id_kategori')
                    ->orderBy('kategori_menu.nama_kategori', 'ASC')
                    ->findAll();