UAS/warungemak/app/Models/Admin/AdminMenuModel.php

    public function getAllMenu()
    { {
            return $this->select('daftar_menu.*, kategori_menu.nama_kategori')
                ->join('kategori_menu', 'kategori_menu.id_kategori = daftar_menu.id_kategori') // Join tabel kategori
                ->findAll();
---
SELECT `daftar_menu`.*, `kategori_menu`.`nama_kategori`
FROM `daftar_menu`
JOIN `kategori_menu` ON `kategori_menu`.`id_kategori` = `daftar_menu`.`id_kategori`