UAS/warungemak/app/Controllers/UsersLogin.php

    public function authenticate()
    {
        $session = session();
        $LoginUsersModel = new LoginusersModel();

        // Ambil data dari form login
        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        // Cek validasi users
        $users = $LoginUsersModel->where('email', $email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'vitoardiyanto583@gmail.com'
 LIMIT 1